---
title: 网络工程 课堂练习
date: 2021-11-14
tags:
 - 网络
categories:
 - 课堂练习
---



# 网络工程设计



## 环境支持

#### 软件

>1. Packet tracer与汉化包
>   链接:
>   https://pan.baidu.com/s/18b0pfO0WqVoa5laPL-HjZw 提取码: qnh6
>   将Chinese.ptl 文件放到 C:\Program
>   Files\Cisco Packet Tracer 7.3.1\languages 目录
>2. eNSP
>   链接：
>   https://pan.baidu.com/s/160T8W7_gECGN09ZZAn0vGw 提取码：3x87
>3. 视频合并
>   链接:
>   https://pan.baidu.com/s/1LG1ICRUtL6OgQeINFNbuQ 提取码: 96yk



#### 文档

>1. 实验指导
>   i. 链接:
>   https://pan.baidu.com/s/1Kh8FzJ5o2Pkd55yfdAOA-w 提取码: cvz2
>2. 华为USG5500防火墙产品文档
>   i. 链接:
>   https://pan.baidu.com/s/1H9opd5RHmm_JjQOKP3oSOQ 提取码: fjgc



## 实验1.1



### 交换机物理接口

![console](https://gss0.baidu.com/9vo3dSag_xI4khGko9WTAnF6hhy/zhidao/wh%3D600%2C800/sign=3b2bb171d4f9d72a1731181be41a040c/f9198618367adab46b8ace0d86d4b31c8701e422.jpg)

![console](https://p1.ssl.qhimg.com/t011ba89fb1f96dfcd1.jpg)



### 基本操作

#### Huawei eNSP

1. **视图切换**

   | 视图           | 提示符                 | 进入命令                                |  退出命令   |
   | -------------- | ---------------------- | --------------------------------------- | :---------: |
   | 用户视图       | Huawei                 | 与交换机建立连接即进入                  |    quit     |
   | 系统视图       | [Huawei]               | 用户视图下键入system-view               | quit return |
   | 以太网端口视图 | [Huawei-Ethernet1/0/1] | 系统视图下键入interface ethernet  1/0/1 | quit return |
   | VLAN视图       | [Huawei-vlan1]         | 系统视图下键入vlan 1                    | quit return |
   | VLAN接口视图   | [Huawei-Vlanif1]       | 系统视图下键入interface Vlanif 1        | quit return |
   
   
   
2. **错误信息**

   | 英文错误信息                          | 错误原因                                                     |
   | ------------------------------------- | ------------------------------------------------------------ |
   | Unrecognized command                  | 没有查找到命令    没有查找到关键字   参数类型错    参数值越界 |
   | Incomplete command                    | 输入命令不完整                                               |
   | Too many parameters                   | 输入参数太多                                                 |
   | Ambiguous command                     | 输入参数不明确                                               |
   | Wrong parameter found at '^' position | 在'^'所指的位置发现错误的参数                                |

   

3. **完全帮助   ?**

   ```
   <Huawei> ?
   <Huawei> clock ?
   [Huawei] interface Vlanif ?
   ```

   键入命令的某个关键字的前几个字母，按下Tab键，如果以输入字母开头的关键字唯一，用户终端屏幕上会显示出完整的关键字；如果与输入字母匹配的关键字不唯一，则终端屏幕依次显示字母匹配的关键字。

   

4. **常用命令**

```
<Huawei> system-view			进入系统试图
[Huawei] sysname s1				修改设备名为 s1
[Huawei] display version 			查看IOS版本、板卡型号
[Huawei] display interface brief	查看设备端口编号
[Huawei] display brief interface	同上
[Huawei] display interface Ethernet 0/0/1	显示0/0/1端口信息
[Huawei] display clock			显示当前设备时间
<Huawei> clock datetime HH:MM:SS YYYY/MM/DD	修改当前设备时间
[Huawei] display current-configuration		显示当前设备所有配置信息
[Huawei] display saved-configuration		显示当前设备保存的配置信息
<Huawei> save 					保存配置信息
<Huawei> reset saved-configuration 			清除当前设备保存的配置信息
<Huawei> reboot					设备重启
[Huawei] display this			查看当前配置过的命令

```



#### Cisco Packet Tracer

> [【思科交换机模拟器命令大全】_code_zbw-CSDN博客](https://blog.csdn.net/VariatioZbw/article/details/108212741)

1. **视图切换**

   | 视 图        | 提示符               | 进入命令                               |   退出命令   |
   | ------------ | -------------------- | -------------------------------------- | :----------: |
   | 用户模式     | Switch>              | 与交换机建立连接即进入                 | exit  logout |
   | 特权模式     | Switch#              | 用户模式键入enable                     | exit  logout |
   | 全局模式     | Switch(config)#      | 特权模式键入configure terminal         |  exit  end   |
   | 端口模式     | Switch(config-if)#   | 全局模式键入interface fastEthernet 0/1 |  exit  end   |
   | VLAN模式     | Switch(config-vlan)# | 全局模式键入vlan 2                     |  exit  end   |
   | VLAN接口模式 | Switch(config-if)#   | 全局模式键入interface vlan 1           |  exit  end   |
   | 线路配置模式 | Switch(config-line)# | 全局模式键入line vty 0 4               |  exit  end   |

   

2. **常用命令**

   ```
   Switch> enable					进入特权模式
   Switch# configure terminal		进入全局模式
   Switch(config)# hostname s1		修改设备名为 s1
   Switch# show version 			查看IOS版本、板卡型号
   Switch# show interfaces status	查看设备端口编号
   Switch# show interfaces fastethernet 0/1	显示0/1端口信息
   Switch# show clock				显示当前设备时间
   Switch# show running-config 	显示当前设备所有配置信息
   Switch# show startup-config 	显示当前设备保存的配置信息
   Switch# write					保存配置信息
   Switch# erase startup-config	清除当前设备保存的配置信息
   Switch# reload					设备重启
   
   ```

   


## 实验1.2



### 远程登录到交换机

1. **设置IP地址**

   - 设置PC的IP地址1.1.1.2

   - 配置交换机(Packet Tracer)

     ```
     Switch> enable	
     Switch# conf t  					进入特权模式/配置视图
     Switch(config)# interface vlan 1 	进入对应的接口
     Switch(config-if)# ip address 1.1.1.1 255.0.0.0	设置IP
     Switch(config-if)# no shutdown		启动接口
     ```

   - 在PC命令行测试

     ```
     C:\>ipconfig		查看自己IP信息
     C:\>ping 1.1.1.1
     ```

2. **telnet链接**

   - 配置交换机(Packet Tracer)

     ```
     Switch(config)# line vty 0 15
     Switch(config-line)# password 123
     Switch(config-line)# login
     ```

   - 在PC命令行测试

     ``` 
     C:\>telnet 1.1.1.1
     Password:
     Switch>enable
     % No password set	没有设置密码 权限不够 不能进入特权模式
     ```
     
   - 配置交换机 设置密码

     ```
     Switch(config-line)# exit
     设置密码 法一 
     Switch(config)# enable secret 456
     设置密码 法二 
     Switch(config)# enable password 789
     
     secret加密密码 password非加密密码
     当存在两个密码 首选secret密码
     ```

   - 在PC命令行测试

     ```
     C:\>telnet 1.1.1.1
     Password:
     Switch>enable
     Switch#
     ```




### 基于端口方式划分VLAN

VLAN从逻辑上把一个VLAN交换机接口划分成3个VLAN

- VLAN10	 1~8
- VLAN20     17~24
- VLAN1        默认为此



### Packet Tracer



#### 将PC划分到不同的VLAN

Packet Tracer中设置拓扑结构

![将PC划分到不同的VLAN](https://img.wendangwang.com/pic/a54a786b7912ead831c56930/1-213-png_6_0_0_191_771_509_240_893.25_1263.375-453-0-0-453.jpg)

1. 配置交换机 创建VLAN

   ```
   Switch> enable
   Switch# conf t
   Switch(config)# vlan 10					创建VLAN 10
   Switch(config-vlan)# name department1	说明性文字 这个VLAN分给了哪个单位
   Switch(config-vlan)# exit
   Switch(config)# vlan 20					创建VLAN 20
   Switch(config-vlan)# name department2
   Switch(config-vlan)# exit
   ```

2. 将交换机端口分配到VLAN中

   > Access 类型的端口：只能属于1 个VLAN，一般用于连接计算机的端口；					

   ```
   Switch# interface fastEthernet 0/1
   Switch(config-if)# switchport access vlan 10			将0/1端口(access类型)分给vlan 10
   Switch(config-if)# no shutdown
   Switch(config-if)# exit
   Switch(config)# 
   Switch(config)# interface range fastEthernet 0/17 - fastEthernet 0/24
   Switch(config-if-range)# switchport access vlan 20		将0/17到0/24端口(access类型)分给vlan 20
   Switch(config-if-range)# no shutdown
   ```

3. 查看VLAN信息

   ```
   Switch# show vlan
   ```

4. 删除VLAN信息（需要的话）

   ```
   Switch# configure terminal
   Switch(config)# no vlan 20		删除VLAN 20
   ```



#### 跨多台交换机配一个VLAN

Packet Tracer中设置拓扑结构

<img src="https://img-blog.csdnimg.cn/20181027224722889.png?x-oss-process=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9ibG9nLmNzZG4ubmV0L2xseHlibQ==,size_27,color_FFFFFF,t_70" alt="端口聚合" style="zoom:80%;" />

1. 配置两台交换机

   > Access 类型的端口：只能属于1 个VLAN，一般用于连接计算机的端口；
   >
   > Trunk 类型的端口：可以允许多个VLAN 通过，可以接收和发送多个VLAN 的报文，一般用于交换机之间连接的端口
   
   ```
   Switch1> enable
   Switch1# conf t
   Switch1(config)# int f0/10
   Switch1(config-if)# switchport mode trunk				改变0/10端口模式
   Switch1(config-if)# switchport trunk allowed vlan all	允许通过的VLAN号
   Switch1(config-if)# end
   Switch1# show interface f 0/10 switchport
   Switch1# show interface trunk
   ```
   
   ```
   Switch2> enable
   Switch2# conf t
   Switch2(config)# int f0/10
   Switch2(config-if)# switchport mode trunk				改变0/10端口模式
   Switch2(config-if)# switchport trunk allowed vlan 10,20	允许通过的VLAN号
   Switch2(config-if)# exit
   ```
   
2. PC测试

   ```
   C:\> ipconfig
   C:\> ping x.X.X.X
   ```



#### 端口聚合

Packet Tracer中设置拓扑结构

<img src="https://www.pianshen.com/images/472/0d8ba8d7733216d8972f993187c7b338.png" alt="端口聚合" style="zoom:80%;" />

> 多条线会阻塞，需要加到一个汇聚口里面

1. 配置交换机

   ```
   Switch1# conf t
   Switch1(config)# int range f0/10-11
   Switch1(config-if-range)# channel-group 1 mode on	汇聚到同一个组
   可能报错：10号口开放 11号口关闭 不兼容
   	Switch1(config-if-range)# exit
   	Switch1(config)# int f0/11
   	Switch1(config-if)# switchport mode trunk		把11号口也改为trunk模式
   	Switch1(config-if)# exit
   Switch1(config)#
   Switch1(config)# int range f0/10-11
   Switch1(config-if-range)# channel-group 1 mode on	汇聚到同一个组
   Switch1(config-if)# exit
   Switch1(config)#
   Switch1(config)# interface port-channel 1			配置组
   Switch1(config)# switchport mode trunk				把整个组设置为trunk
   ```

   ```
   Switch2# conf t
   Switch2(config)# int range f0/10-11
   Switch2(config-if-range)# channel-group 1 mode on
   Switch2(config-if-range)# exit
   Switch2(config)# interface port-channel 1			
   Switch2(config)# switchport mode trunk
   ```

   > 以什么方式进行负载均衡(load-balance)
   >
   > Switch(config)# port-channel load-balance dst-ip	
   >
   > dst-ip
   >
   > dst-mac
   >
   > Mac

2. PC测试 / 交换机查看

   ```
   C:\> ipconfig
   C:\> ping x.X.X.X
   ```

   ```
   Switch# show spanning-tree
   Switch# show interface trunk		查看trunk
   Switch# show etherchannel summary	查看端口汇聚
   ```



### Huawei eNSP

#### 交换机创建VLAN

```
<Huawei> system-view	
[Huawei] vlan 2
[Huawei-vlan2] description team1
[Huawei-vlan2] vlan 3
[Huawei-vlan3] description team2
```

#### 分配端口

```
[Huawei]interface Ethernet 0/0/1
[Huawei-Ethernet0/0/1]port link-type access 
[Huawei-Ethernet0/0/1]port default vlan 2
[Huawei]

[Huawei]interface Ethernet 0/0/2
[Huawei-Ethernet0/0/1]port link-type access 
[Huawei-Ethernet0/0/1]port default vlan 3
```

#### Trunk端口配置

```
[Huawei]int e 0/0/8
[Huawei-Ethernet0/0/8]port link-type trunk

[Huawei-Ethernet0/0/8]port trunk allow-pass vlan all
[Huawei-Ethernet0/0/8]port trunk allow-pass vlan 2 to 3 
```

#### 设置端口汇聚

> 设置端口汇聚，要先将7/8端口trunk配置好

```
[Huawei]interface Eth-Trunk 1
[Huawei-Eth-Trunk1]mode manual load-balance 
[Huawei] interface Ethernet 0/0/7
[Huawei-Ethernet0/0/7] eth-trunk 1
[Huawei-Ethernet0/0/7] interface Ethernet 0/0/8
[Huawei-Ethernet0/0/8] eth-trunk 1
[Huawei-Ethernet0/0/8] return
```



## 实验2.1

### VLAN间路由

#### 1.设置PC机IP地址，网关地址

> 网关地址 与 路由器所连**接口**地址 一致

#### 2.设置路由器接口地址

```
roa(config)# int f0/0
roa(config)# ip address 210.65.1.2 255.255.255.0
roa(config)# no shutdown
roa(config)# exit
```

#### 查错 测试

> PC 测试路由 查错

```
PCA
C:\> ping 210.65.1.2   //ping自己的网关
C:\> ping 210.66.1.2   //ping f0/1
C:\> ping 210.66.1.1   //ping PCB
PCB
C:\> ping 210.66.1.2   //ping自己的网关
C:\> ping 210.65.1.2   //ping f0/0
C:\> ping 210.65.1.1   //ping PCA
```

> 路由器查看

```
roa# show ip route   //显示IP路由表
```

#### 理论

传统VLAN间路由

单臂路由器VLAN间路由

3层交互机上的VLAN间路由



### PT - 单臂路由器VLAN 间路由



1. - 在交换机上添加 VLAN

   > 在S1上创建 VLAN 10 和 VLAN 30。

   ```
   S1(config)# vlan 10
   S1(config-vlan)# name VLAN10
   S1(config-vlan)# exit
   S1(config)# vlan 20
   S1(config-vlan)# name VLAN20
   S1(config-vlan)# exit
   ```

   - 把 VLAN 分配给端口

   ```
   S1(config)# interface f0/11
   S1(config-if)# switchport mode access
   S1(config-if)# switchport access vlan 10
   S1(config-if)# no shut
   S1(config-if)# exit
   
   S1(config)# interface f0/6
   S1(config-if)# switchport mode access
   S1(config-if)# switchport access vlan 30
   S1(config-if)# no shut
   S1(config-if)# exit
   
   S2# show vlan brief
   ```

2. 配置子接口

   ```
   R1(config)# int g0/0.10
   R1(config-subif)# encapsulation dot1Q 10
   R1(config-subif)# ip address 172.17.10.1 255.255.255.0
   
   R1(config)# int g0/0.30
   R1(config-subif)# encapsulation dot1Q 30
   R1(config-subif)# ip address 172.17.30.1 255.255.255.0
   ```

   > encapsulation dot1Q 10
   >
   > dot1Q表示trunk类型 
   >
   > 10表示和VALN10关联

   > 整个物理接口启动一下

   ```
   R1(config)# interface g0/0
   R1(config-if)# no shut
   R1(config-if)# end
   ```

   

3. 启用中继

   ```
   S1(config)# interface f0/1
   S1(config-if)# switchport mode trunk
   S1(config-if)# no shut
   S1(config-if)# end
   ```

   

4. 测试 VLAN 间路由的连通性

   **ping 一下**

   

   

   

  

### PT-3层交互机上的VLAN间路由

- **配置第 3 层交换**

  在 MLS 上，把 G0/2 配置为路由端口，并根据地址分配表分配 IP 地址

  ```
  MLS(config)# interface g0/2
  MLS(config-if)# no switchport
  MLS(config-if)# ip address 209.165.200.225 255.255.255.252
  ```

  > 通过 ping 209.165.200.226 来验证与 Cloud 的连通性
  >
  > MLS# ping 209.165.200.226

- **配置 VLAN 间路由**

1. 添加 VLAN,在 MLS 上配置 SVI

   ```
   MLS(config)#vlan 10
   MLS(config-vlan)# name Staff
   MLS(config)#vlan 20
   MLS(config-vlan)# name Student
   MLS(config)#vlan 30
   MLS(config-vlan)# name Faculty
   
   MLS(config)# interface vlan 10
   MLS(config-if)# ip add 192.168.10.254 255.255.255.0
   MLS(config)# interface vlan 20
   MLS(config-if)# ip add 192.168.20.254 255.255.255.0
   MLS(config)# interface vlan 30
   MLS(config-if)# ip add 192.168.30.254 255.255.255.0
   ```

2. 在MLS上配置中继

   ```
   MLS(config)# interface g0/1
   MLS(config-if)# switchport mode trunk
   MLS(config-if)# switchport trunk native vlan 99 	//本征valn设为99 为兼容一些早期设备，现在一般用的很少
   MLS(config-if)# switchport trunk encapsulation dot1q	//使用dot1q协议封装链路
   ```

3. 在S1上配置中继

   ```
   S1(config)# int g0/1
   S1(config-if)# switchport mode trunk
   ```

4. 启用路由

   ```
   MLS(config)# ip routing
   
   MLS# show ip route  //验证路由转发功能已经启用
   ```

5. ping 一下

- **配置 IPv6 VLAN 间 路由**

1. 启用 IPv6 路由

   ```
   MLS(config)# ipv6 unicast-routing
   ```

2. 在 MLS 上给 SVI 配置 IPv6。

   ```
   MLS(config)# interface vlan 10
   MLS(config-if)# ipv6 address 2001:db8:acad:10::1/64
   
   MLS(config)# interface vlan 20
   MLS(config-if)# ipv6 address 2001:db8:acad:20::1/64
   
   MLS(config)# interface vlan 30
   MLS(config-if)# ipv6 address 2001:db8:acad:30::1/64
   ```

3. 在 MLS 上给 G0/2 配置 IPv6

   ```
   MLS(config)# interface G0/2
   MLS(config-if)# ipv6 address 2001:db8:acad:a::1/64
   //使用命令show ipv6 route 验证 IPv6 互联 网络。
   MLS# show ipv6 route
   ```

4. ping 一下

### ensp - 单臂路由器VLAN 间路由





### ensp-3层交互机上的VLAN间路由





## 实验2.1

### 下一跳静态路由

> 仅能指定下一跳的IP地址
>
> 出站接口是从下一跳获得的

**IPv4**

```
//ip route 网络 掩码 下一跳的IP地址
R1(config)# ip route 172.16.1.0 255.255.255.0 172.16.2.2
R1(config)# ip route 192.168.1.0 255.255.255.0 172.16.2.2
R1(config)# ip route 192.168.2.0 255.255.255.0 172.16.2.2
```

**IPv6**

```
R1(config)# ipv6 unicast-routing
//ipv6 route 网络 掩码 下一跳的IP地址
R1(config)# ipv6 route 2001:db6:acad:1::/64  2001:db6:acad:2::2
R1(config)# ipv6 route 2001:db8:cafe:1::/64  2001:db6:acad:2::2
R1(config)# ipv6 route 2001:db8:cafe:2::/64  2001:db6:acad:2::2
```

### 直连静态路由

> 使用 出站接口 指定下一跳路由

> 一般**建议使用** 下一跳地址
>
> 直连静态路由只应该用于 **点到点串行接口**

**IPv4**

```
//ip route 网络 掩码 出站接口
R1(config)# ip route 172.16.1.0 255.255.255.0 s0/1/0
R1(config)# ip route 192.168.1.0 255.255.255.0 s0/1/0
R1(config)# ip route 192.168.2.0 255.255.255.0 s0/1/0
```

**IPv6**

```
//ipv6 route 网络 掩码 下一跳的IP地址
R1(config)# ipv6 route 2001:db6:acad:1::/64  s0/1/0
R1(config)# ipv6 route 2001:db8:cafe:1::/64  s0/1/0
R1(config)# ipv6 route 2001:db8:cafe:2::/64  s0/1/0
```

### 完全指定静态路由

> 同时指定 **出站接口** 和 **下一跳IP地址**

> 是否使用 出站接口 是可选的，但 下一跳地址 必须使用
>
> 建议 当出站接口为以太网，设置静态路由时包含 下一跳地址，
>
> 也可使用 完全指定静态路由 同时指定 出站接口 和 下一跳IP地址

**IPv4**

```
//ip route 网络 掩码 出站接口 下一跳的IP地址
R1(config)# ip route 172.16.1.0 255.255.255.0 GigabitEthernet 0/0/1 172.16.2.2
R1(config)# ip route 192.168.1.0 255.255.255.0 GigabitEthernet 0/0/1 172.16.2.2
R1(config)# ip route 192.168.2.0 255.255.255.0 GigabitEthernet 0/0/1 172.16.2.2
```

**IPv6**

> IPv6完全指定静态路由 必须指定 出站接口 才能确定 IPv6链路本地地址

```
✖
R1(config)# ipv6 route  2001:db8:cafe:1::/64 fe80::2
报错%Interface has no be specified for a link-local nexthop
✔
R1(config)# ipv6 route  2001:db8:cafe:1::/64 s0/1/0 fe80::2
```

### 验证静态路由

> show ip route
>
> show ipv6 route
>
> ping
>
> traceroute	//经过的所有的路由器IP
>
> show ip route static		//显示静态路由
>
> show ip route *network*	//显示network网络的路由
>
> show running-config | section ip route

###  默认静态路由

```
ipv4
R1(config)# ip route 0.0.0.0 0.0.0.0 172.16.2.2
ipv6
R1(config)# ipv6 route ::/0 2001:db8:acad:2::2
```

###   PT-实验

配置 IPv4 静态和 浮动静态默认路由

```
Edge_Router(config)# ip route 0.0.0.0 0.0.0.0 s0/0/0
Edge_Router(config)# ip route 0.0.0.0 0.0.0.0 s0/0/1 5
```

配置 IPv6 静态和 浮动静态默认路由

```
Edge_Router(config)# ipv6 route ::/0 2001:db8:a:1::1
Edge_Router(config)# ipv6 route ::/0 2001:db8:a:2::1 5
```

配置指向内部 LAN 的 IPv4 静态和 浮动静态路由

```
ISP1(config)# ip route 192.168.10.16 255.255.255.240 10.10.10.2
ISP1(config)# ip route 192.168.11.32 255.255.255.224 10.10.10.2

ISP1(config)# ip route 192.168.10.16 255.255.255.240 s0/0/0 5
ISP1(config)# ip route 192.168.11.32 255.255.255.224 s0/0/0 5
```

配置去往内部 LAN 的 IPv6 静态和浮动 静态路由

```
ISP1(config)# ipv6 route 2001:db8:1:10::/64 2001:db8:a:1::2
ISP1(config)# ipv6 route 2001:db8:1:11::/64 2001:db8:a:1::2

ISP1(config)# ipv6 route 2001:db8:1:10::/64 2001:db8:a:2::1/64 5
ISP1(config)# ipv6 route 2001:db8:1:11::/64 2001:db8:a:2::1/64 5
```

配置 IPv4 主机路由

```
Edge_Router(config)# ip route 198.0.0.10 255.255.255.255 s0/0/0
Edge_Router(config)# ip route 198.0.0.10 255.255.255.255 s0/0/1 5
```

配置 IPv6 主机路由

.......

### Huawei ensp-实验

#### 静态路由及默认路由基本配置

1. 配置各个端口IP

2. R1

   ```
   [R1] ip route-static 192.168.20.0 24 10.0.12.2
   [R1] ip route-static 10.0.23.0 24 10.0.12.2
   ```

3. R2

   ```
   [R2] ip route-static 192.168.20.0 24 10.0.23.3
   [R2] ip route-static 192.168.10.0 24 Serial 1/0/1
   ```

4. R3

   ```
   [R3] ip route-static 192.168.10.0 24 Serial 1/0/1
   [R3] ip route-static 10.0.12.0 24 Serial 1/0/1
   ```

5. ping 测试

#### 浮动路由及负载均衡

1. 配置各个端口IP

2. 配置路由

   ```
   [R1] ip route-static 192.168.20.0 24 10.0.13.3
   [R2] ip route-static 192.168.20.0 24 10.0.23.3
   [R2] ip route-static 192.168.10.0 24 10.0.12.1
   [R3] ip route-static 192.168.10.0 24 10.0.13.1
   ```

   > ping 192.168.20.20
   >
   > tracert 192.168.20.20    检查经过的所有网关
   >
   > R2 ping PC1、PC2 =>R2是否可访问PC1/2网络

3. 配置浮动路由实现路由备份

   ```
   [R1] ip route-static 192.168.20.0 24 10.0.12.2 preference 100
   [R1] display ip routing-table protocol static
   
   [R3] ip route-static 192.168.10.0 24 10.0.23.2 preference 100
   ```

   在R1中关闭S1/0/1接口，验证 路由备份 是否启用

   ```
   [R1] int s1/0/1
   [R1-Serial1/0/1] shutdown
   
   [R1] display ip routing-table
   [R1] display ip routing-table protocol static
   ```

   >PC1 ping PC2 => 路由备份启用

4. 负载均衡 优化网络

   ```
   开启S1/0/1接口
   [R1] int s1/0/1
   [R1-Serial1/0/1] undo shutdown
   [R1] ip route-static 192.168.20.0 24 10.0.12.2
   
   [R3] ip route-static 192.168.10.0 24 10.0.23.2
   ```

5. ping tracert 测试

## 实验3.1

### RIP

> **C类**地址 缺省 network **192.168.1.0**
>
> **A类**地址 缺省 network  **10.0.0.0**

``` 
R1# conft
R1(config)# router rip
R1(config-router)# network 192.168.1.0
```

> 检验 RIP

 ```
 R1# show ip protocols
 R1# show ip route| begin Gateway    // R开头 RIP协议
 ```

> 启用 **RIPv2**

```
R1(config)# router rip
R1(config-router)# version 2
//查看版本
R1# show ip protocols
```

> 禁用 **自动汇总**

```
R1(config)# router rip
R1(config-router)# no auto-summary
```

> 配置 **被动接口**

```
R1(config)# router rip
R1(config-router)# passive-interface g0/0	//把 g0/0 接口配置 被动接口
R1(config-router)# end
```

> 配置 **传播默认路由**

```
R1(config)# ip route 0.0.0.0 0.0.0.0 s0/0/1 209.165.200.226
R1(config)# router rip
R1(config-router)# default-information originate

R1# show ip route| begin Gateway	//s* 开头 为传播默认路由
```



### OSPF

> 1. 单区域
>
> 2. 多区域
>
> 3. DP 和 BDR 选举



> 设定 **路由器 ID号**

```
R1(config)# router ospf 10
R1(config-router)# router-id 1.1.1.1
R1(config-router)# end
要是ID更改生效 不要忘了此命令
R1# clear ip ospf process
y
R1# show ip protocols | section Router ID
```

> **环回接口** 设定 **路由器 ID号**

```
R1(config)# interface loopback 0
R1(config-if)# ip address 1.1.1.1 255.255.255.255 
```

> 在接口上，启用OSPF
>
> **wildcard_mask** 通配符掩码  子网掩码取反
>
> 255.255.225.0	->	0.0.0.255
>
> 255.255.255.192	-> 0.0.0.063
>
> **area-id** 单区域一般为 0

```
R1(config)# router ospf x
R1(config-router)# network x.x.x.x wildcard_mask area area-id

传统方法
R1(config)# router ospf 10
R1(config-router)# network 172.16.1.0 0.0.0.255 area 0
R1(config-router)# network 172.16.3.0 0.0.0.3 area 0
R1(config-router)# network 192.168.10.4 0.0.0.3 area 0
法2
R1(config)# router ospf 10
R1(config-router)# network 172.16.1.1 0.0.0.0 area 0
R1(config-router)# network 172.16.3.1 0.0.0.0 area 0
R1(config-router)# network 192.168.10.5 0.0.0.0 area 0
```

> 配置 **被动接口**

```
R1(config)# router ospf
R1(config-router)# passive-interface g0/0	//把 g0/0 接口配置 被动接口
R1(config-router)# end
```

> **调整接口带宽**

```
R1(config)# interface s0/0/1
R1(config-if)# bandwidth 64

R2(config)# interface s0/0/1
R2(config-if)# bandwidth 1024
```

> **手动设置 OSPF 开销**

```
//关闭 之前 调整的接口带宽
R1(config)# interface s0/0/1
R1(config-if)# no bandwidth 64
//手动设置 OSPF 开销
R1(config)# int s0/0/1
R1(config-if)# ip ospf cost 15625

R2(config)# int s0/0/1
R2(config-if)# ip ospf cost 976
```

> 验证 **OSPF 邻居**

```
R1# show ip ospf neighbor
```



### PT-实验



### eNSP-实验



## 实验3.2













### PT-实验



### eNSP-实验
